app/views/stores/show.html.erb

SELECT "game_tables".* FROM "game_tables" WHERE "game_tables"."store_id" = ?  [["store_id", 3]]
SELECT "games".* FROM "games" WHERE "games"."store_id" = ?  [["store_id", 3]]
---
  </tr>
    <% @store.game_tables.each do |table| %>