app/views/game_sessions/index.html.erb

    <td><%= link_to session.store.name, store_path(session.store) %></td>
    <td><%= session.players.count%>
---
SELECT COUNT(*) FROM "players" INNER JOIN "game_sessions_players" ON "players"."id" = "game_sessions_players"."player_id" WHERE "game_sessions_players"."game_session_id" = ?  [["game_session_id", 1]]