app/views/game_sessions/new.html.erb

SELECT "games".* FROM "games"
---
    <%= f.label :games %><br>
    <%= f.collection_select :game_id, Game.all, :id, :name %><br>

SELECT "game_tables".* FROM "game_tables"
---
    <%= f.label :game_tables %><br>
    <%= f.collection_select :game_table_id, GameTable.all, :id, :table_name %><br>

SELECT "players".* FROM "players"
---
<%= f.label :players %><br>
    <%= f.collection_check_boxes :player_ids, Player.all, :id, :name %><br>