app/views/game_sessions/show.html.erb

SELECT "players".* FROM "players" INNER JOIN "game_sessions_players" ON "players"."id" = "game_sessions_players"."player_id" WHERE "game_sessions_players"."game_session_id" = ?  [["game_session_id", 1]]
---
        <ul style="width:45%">
        <% @game_session.players.each do |player|%>