app/views/games/index.html.erb

SELECT "stores".* FROM "stores"
---
    <ul style="width:45%">
    <% Store.all.each do |store|%>

SELECT "games".* FROM "games" WHERE "games"."store_id" = ?  [["store_id", 1]]
---
            <ul>
            <% store.games.each do |game| %>