app/views/games/show.html.erb

<p> Click on a game session below to get started playing!</p>
<% @game.game_sessions.each do |game_session| %>
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."game_id" = ?  [["game_id", 1]]