app/controllers/application_controller.rb

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def current_player
        if session[:player_id]
            @player = Player.find(session[:player_id])