app/controllers/game_sessions_controller.rb

  def index
    @game_sessions = GameSession.all
---
SELECT "game_sessions".* FROM "game_sessions"

  def show
    @game_session = GameSession.find(params[:id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @game_session = GameSession.new(session_name: game_session_params[:session_name], game_id: game_session_params[:game_id], game_table_id: game_session_params[:game_table_id])

    if @game_session.valid?
      @game_session.save
      player = Player.find(session[:player_id])
---
INSERT INTO "game_sessions" ("game_table_id", "game_id", "session_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_table_id", 1], ["game_id", 1], ["session_name", "Steve"], ["created_at", "2020-03-03 22:33:00.095447"], ["updated_at", "2020-03-03 22:33:00.095447"]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def add_player
    @game_session = GameSession.find(params[:id])
    player = Player.find(session[:player_id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def edit
    @game_session = GameSession.find(params[:id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @game_session = GameSession.find(params[:id])
    @game_session.destroy
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "game_sessions" WHERE "game_sessions"."id" = ?  [["id", 4]]

  def player_present?
    @game_session = GameSession.find(params[:id])
    player = Player.find(session[:player_id])
    @game_session.player_ids.include?(player.id)
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "players"."id" FROM "players" INNER JOIN "game_sessions_players" ON "players"."id" = "game_sessions_players"."player_id" WHERE "game_sessions_players"."game_session_id" = ?  [["game_session_id", 3]]

  def is_table_space_available?
    @game_session = GameSession.find(params[:id])
    @game_session.game_table.players.count < @game_session.game_table.seats_available
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "game_tables".* FROM "game_tables" WHERE "game_tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "players" INNER JOIN "game_sessions_players" ON "players"."id" = "game_sessions_players"."player_id" INNER JOIN "game_sessions" ON "game_sessions_players"."game_session_id" = "game_sessions"."id" WHERE "game_sessions"."game_table_id" = ?  [["game_table_id", 1]]

  def find_game_session
    @game_session = GameSession.find(params[:id])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]