app/controllers/players_controller.rb

INSERT INTO "players" ("name", "bio", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dane"], ["bio", "I am awesome"], ["age", 33], ["created_at", "2020-03-03 17:20:32.332784"], ["updated_at", "2020-03-03 17:20:32.332784"]]
---
  def create
    @player = Player.new(player_params)

    if @player.valid?
      @player.save

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 3]]
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy