app/controllers/sessions_controller.rb

SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Dane"], ["LIMIT", 1]]
---
  def create
    @player = Player.find_by(name: params[:name])