app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @store = Store.find(params[:id])