app/views/layouts/application.html.erb

SELECT "players".* FROM "players"
---
            <br>
            <% Player.all.each do |player| %>

SELECT "stores".* FROM "stores"
---
            <div class="dropdown-content">
              <% Store.all.each do |store|%>